{
    "spiritual": [
        "“The spirits of the dead are so much more interesting to talk with than the living.”",
        "“In the end, it’s all just entropy. Everything falls apart someday.”",
        "{Subjective} is convinced that everyone else in {possessive} conclave has a deeper connection to the divine than {subjective} does.",
        "“Whatever happens is fated, regardless of any planning or striving.”",
        "“Material wealth is an illusion. Wisdom is the real treasure.”",
        "“The dead and their belongings deserve to be treated with respect.”",
        "{Subjective} is a skeptic and doesn’t believe in the power of rituals, religion, superstition, or spirits.",
        "{Subjective} knows {possessive} future is written and that anything {subjective} does will lead to a prophesied end.",
        "{Subjective} trusts that {possessive} deity will guide {possessive} actions. {Subjective} has faith that if {subjective} work hard, things will go well.",
        "{Subjective} puts too much trust in those who wield power within {possessive} temple's hierarchy.",
        "{Possessive} piety sometimes leads {objective} to blindly trust those that profess faith in {possessive} god."
    ],
    "criminal": [
        "“The law doesn’t protect the honest and the hard working. {Subjective} is going to do whatever needs to be done to make things right.”",
        "{Subjective} has been wronged {possessive} entire life, and the world owes {objective}.",
        "Everyone {subjective} sees is getting theirs, so {Subjective} is surely going to get mine.",
        "{Subjective} can’t afford to trust anyone. Not. Anyone.",
        "“If you want to succeed, you have to take risks.”",
        "“Nothing is certain. Planning is a coward’s act.”",
        "{Subjective} never targets people who can't afford to lose a few coins.",
        "{Subjective} never runs the same con twice.",
        "{Subjective} doesn't steal from others in the trade.",
        "{Subjective} is always in debt. {Subjective} spends {possessive} ill-gotten gains on decadent luxuries faster than {subjective} bring them in.",
        "{Subjective} is convinced that no one could ever fool {objective} in the way {subjective} fools others.",
        "{Subjective} can't resist swindling people who are more powerful than {objective}.",
        "When {subjective} sees something valuable, {subjective} can't think about anything but how to steal it.",
        "{Subjective} thinks it's not stealing if {subjective} needs it more than someone else."
    ],
    "martial": [
        "“One day, {subjective} will be the one giving orders.”",
        "“The marines’ code provides a solution for every problem, and following it is imperative.”",
        "“Life is messy. Throwing yourself into the worst of it is necessary to get the job done.”",
        "“The strong train so that they might rule those who are weak.”",
        "“To act when others quake in fear — this is the essence of the warrior.”",
        "“Fear leads to tyranny, and both must be eradicated.”",
        "“You can’t win if you’re dead. Live to fight another day — when the odds might be more in your favor.”",
        "“Winning is the real measure of a person. In the end, the only thing that matters is victory.”",
        "{Possessive} honor is more important to {objective} than {possessive} life.",
        "“Dangerous work is best accomplished by an orderly group working with common purpose.”",
        "“Combat is meant to be quick, clean, and one-sided.”",
        "“Hard work, sacrifice, and training lead to success — and eventually to perfection.”",
        "“Society functions only if people do their duty and respect the chain of command.”",
        "{Possessive} fellows are {possessive} family.",
        "Any defeat or failure on {possessive} part is because {possessive} opponent cheated.",
        "“The best part of winning is seeing {possessive} rivals brought low.”",
        "“The strongest bonds are forged through struggle.”",
        "“Lessons hide in victory and defeat.”",
        "“Sleep is for the weak. {Subjective} needs to keep training more if {subjective} i going to be ready for the challenges ahead.”",
        "“Ambition and pride are the roots of strife.”",
        "{Subjective} never leave a friend behind.",
        "“It is most crucial to act with a single will, marching side by side in perfect accord.”",
        "{Possessive} lot is to lay down {possessive} live in defense of others.",
        "“In life, as in war, the stronger force wins.”",
        "{Possessive} ideals aren't worth killing for or going to war for.",
        "{Subjective} would lay down {possessive} life for the people {subjective} served with.",
        "Someone saved {possessive} life on the battlefield. To this day, {subjective} will never leave a friend behind.",
        "{Possessive} honor is {possessive} life.",
        "{Subjective} will never forget the crushing defeat {possessive} company suffered or the enemies who dealt it.",
        "Those who fight beside {objective} are those worth dying for.",
        "The monstrous enemy {subjective} faced in battle still leaves {objective} quivering with fear.",
        "{Subjective} has little respect for anyone who is not a proven warrior.",
        "{Subjective} made a terrible mistake in battle that cost many lives--and {subjective} would do anything to keep that mistake secret.",
        "{Subjective} does not follow orders blindly, because those who do embrace tyranny."
    ],
    "artisanal": [
        "{Possessive} guild is all that really matters.",
        "If {subjective} take care of {possessive} tools, they’ll take care of {objective}. People come and go, but a tool is something you can always rely on.",
        "“Make what you need out of whatever is at hand.”",
        "The workshop where {subjective} learned {possessive} trade is the most important place in the world to {objective}.",
        "Leaving a lasting legacy in {possessive} craft is the purpose of {possessive} life.",
        "{Subjective} believes that one day {subjective} will be rich."
    ],
    "mercantile": [
        "“Never pass up the opportunity to make an easy bit of coin.” That’s {possessive} motto.",
        "“We all have our roles to play.” {Subjective} will hold up {possessive} end of the bargain.",
        "“The person who gains the most reward for the least effort wins.”",
        "“Three magic beans for just one cow? What a deal!”",
        "{Subjective} will do whatever it takes to become as rich as the oligarchs.",
        "“The economy functions best when chaos is kept under control and everyone knows their place.”",
        "{Subjective} values {possessive} worldly goods more highly than {possessive} mortal life.",
        "“Every copper wants to be a silver. Each deal is an opportunity.”",
        "“The richest bounty goes to those who risk everything.”",
        "“The customer is always right.”",
        "“Why spend gold here when you can buy the same thing for copper in the next town?”",
        "A deal is a deal, and {subjective} would never break one.",
        "{Subjective} will do whatever it takes to get what {subjective} want, regardless of the harm it might cause."
    ],
    "performer": [
        "{Subjective} has belonged to the same performance troupe for years, and these people mean everything to {objective}.",
        "“Music, joy, and laughter are the keys to freedom.”",
        "Fame is more important to {objective} than money.",
        "“If you haven’t heard of {objective}, it must be because of your ignorance and low breeding.”",
        "When {subjective} performs, {subjective} makes the world better than it was.",
        "{Subjective} likes seeing the smiles on people's faces when {subjective} performs. That's all that matters.",
        "“Art should reflect the soul; it should come from within and reveal who we really are.”",
        "{Possessive} instrument is {possessive} most treasured possession, and it reminds {objective} of someone {subjective} loves.",
        "{Subjective} will do anything to win fame and renown.",
        "{Subjective} once satirized a noble who still wants {possessive} head. It was a mistake that {subjective} will likely repeat."
    ],
    "scholarly": [
        "Everything in the multiverse happens in threes. {subjective} see the “rule of three” everywhere.",
        "{Subjective} finds magic in all its forms to be compelling. The more magical a place, the more {subjective} is drawn to it.",
        "“It’s foolish to let emotions and principles interfere with the conclusions of logic.”",
        "{Possessive} vast intellect and strength are directed toward increasing {possessive} sway over others.",
        "“All life is meant to progress toward perfection, and our work is to hurry it along — no matter what must be upended along the way.”",
        "“A free people must be carefully taught, lest they be misled.”",
        "“Knowledge is power, and knowing which cause to back is the key to {possessive} success.”",
        "{Subjective} is happier in a dusty old tomb than {subjective} is in the centers of civilization.",
        "You might think {subjective} is a scholar, but {subjective} loves a good brawl. “These fists were made for punching.”",
        "“Artifact belongs in a museum.”",
        "“With every great discovery comes grave danger. The two walk hand in hand.”",
        "{Subjective} cares about the truth above all else, even if it doesn’t benefit anyone.",
        "{Subjective} would rather observe than meddle.",
        "{Subjective} puts no trust in divine beings.",
        "Inquiry and curiosity are the pillars of {possessive} progress.",
        "{Subjective} considers solitude and contemplation as paths toward mystical or magical power.",
        "{Possessive} path to power and self-improvement is through knowledge.",
        "“Knowledge is the path to power and domination.”",
        "The goal of {possessive} life of study is the betterment of {objective}self.",
        "Most people scream and run when they see a demon. {Subjective} stops and take notes on its anatomy.",
        "{Subjective} is easily distracted by the promise of information.",
        "{Subjective} considers unlocking an ancient mystery is worth the price of a civilization.",
        "Should {possessive} discovery come to light, it could bring ruin to the world.{Subjective}no longer considers existence a possible reality, bus has decided to humor it for now"
    ],
    "outlandish": [
        "{Subjective} prefers to take the less traveled path.",
        "{Subjective} wants to reshape the world into higher forms of life so that all can enjoy evolution.",
        "{Subjective} loves beasts and plants of all kinds, and is loath to harm them.",
        "Unlike people, the beasts of the wild are friends who won’t stab {objective} in the back.",
        "“Laws are for people who are afraid to face their inner beasts.”",
        "“Preserving life and nature is always a worthwhile endeavor.”",
        "“No creature should be made to suffer.”",
        "{subjective} has seen the evil of cities and resist going there.",
        "Like a well-pruned tree, society thrives when everything is kept in good order.",
        "The natural world is more important to {objective} than all the constructs of civilization.",
        "“An injury to the unspoiled wilderness of {possessive} home is an injury to {objective}.”",
        "Now that {subjective} has returned to the world, {subjective} enjoys its delights a little too much.",
        "{Subjective} harbors dark bloodthirsty thoughts that {possessive} recent isolation failed to quell."
    ],
    "tribal": [
        "{Possessive} clan is all that really matters.",
        "“No person or law or custom can tell another what to do.”",
        "“We weren’t born tame or domesticated, so we shouldn’t have to live that way.”",
        "“The strongest are meant to dominate the weak.”",
        "“To live is to feel and express the rage burning in your belly.”",
        "“The Old Ways must be preserved and upheld.”",
        "{Subjective} consideres it {possessive} responsibility to make the most happiness for the whole tribe.",
        "If {subjective} dishonors {objective}self, {subjective} dishonors {possessive} whole clan.",
        "“Tthe strongest are meant to rule.”"
    ],
    "marine": [
        "“If everyone on deck pitches in, we’ll never sink.”",
        "“A ship must be balanced according to the laws of the universe.”",
        "“Muddied water always clears in time.”",
        "“The horizon at sea holds the greatest promise.”",
        "{Possessive} friends are {possessive} crew; “We sink or float together.”",
        "“Good people make even the longest voyage bearable.”",
        "“Do not fish the same spot twice in a row; suppress your greed, and nature will reward you.”",
        "“No wave can move a soul hard at work.”",
        "{Subjective} believes the thing that keeps a ship together is mutual respect between captain and crew.",
        "{Subjective} considers the sea as freedom--the freedom to go anywhere and do anything.",
        "{Subjective} is a predator, and the other ships on the sea are {possessive} prey.",
        "{Subjective} is committed to {possessive} crewmates, not to ideals.",
        "Someday {subjective}'ll own {possessive} own ship and chart {possessive} own destiny.",
        "{Subjective} is loyal to {possessive} captain first, everything else second.",
        "{Possessive} ship is most important--crewmates and captains come and go.",
        "{Subjective} will always remember {possessive} first ship.",
        "In a harbor town, {subjective} has a paramour whose eyes nearly stole {objective} from the sea."
    ],
    "generic": [
        "{Subjective} is critical of monarchies and limits on nobility.",
        "If {subjective} can be everyone’s friend, {subjective} will always have support.",
        "“To measure a being and find it lacking is the greatest disappointment.”",
        "Change is good, which is why {subjective} lives by an ever-changing set of rules.",
        "A trusted friend is the most important thing in the multiverse to {objective}.",
        "{Subjective} thinks the whole multiverse is out to get {objective}.",
        "“Everything in this world dies eventually. The question is, what will you do with the time you have left?”",
        "{Subjective} believes that uplifting {possessive} peers is the best way to succeed.",
        "{Subjective} believes everyone has a price and is cynical toward those who present themselves as virtuous.",
        "“Understanding the world is more important than what you do with your knowledge.”",
        "{Subjective} assume that people mean well until they prove otherwise.",
        "{Subjective} enjoys comfort and quiet, and prefer to avoid extra effort.",
        "“Death comes for everyone, so take as much pleasure as you can from every moment of life.”",
        "{Subjective} resents the rich and powerful.",
        "“There’s no such thing as too much pleasure.”",
        "{Subjective} is beginning to feel like the gods are not on {possessive} side.",
        "“People must have the freedom to do what they want and pursue their dreams.”",
        "{Subjective} is just a small part of a larger whole. So is everyone else.",
        "If people find {objective} unpleasant, that’s their problem.",
        "“Debts are never meant to be forgiven.”",
        "No one could doubt that {subjective} is a cut above the masses of pitiful peasants that infest the city.",
        "{Subjective} can’t stand to spend more than necessary to purchase what {subjective} need.",
        "{Subjective} hates it when people try to make light of a serious situation.",
        "{Subjective} is convinced that everyone {subjective} knows is plotting against {objective}.",
        "{Subjective} is convinced that {subjective} is far more important than anyone else is willing to acknowledge.",
        "“Success depends on cooperation and communication.”",
        "It doesn’t matter if the whole world’s against {objective}. {Subjective} will always do what {subjective} thinks is right.",
        "Nothing is more important than life, and {subjective} never leaves anyone in danger.",
        "{Subjective} believes doom follows {objective} and that anyone who gets close to {objective} will face a tragic end.",
        "{Subjective} is convinced something is after {objective}, appearing in mirrors, dreams, and places where no one could.",
        "{Subjective} knows the ends always justify the means and am quick to make sacrifices to attain {possessive} goals.",
        "{Subjective} needs to find the best in everyone and everything, even when that means denying obvious malice.",
        "{Subjective} is a stickler when it comes to observing proper etiquette and local customs.",
        "{Subjective} assumes the worst in people.",
        "{Subjective} feels no compassion for the dead. They’re the lucky ones.",
        "{Subjective} is a purveyor of doom and gloom who lives in a world without hope.",
        "“Tyrants must fall, no matter the cost.”",
        "“The only way to make a better world is to perform small kindnesses.”",
        "“People should be free to do as they please.”",
        "All life is precious to {objective}. {Subjective} know {subjective} can change the world without taking a humanoid life.",
        "The perfect chance is out there somewhere. {Subjective} just has to keep {possessive} eyes open.",
        "Luck favors {objective}, and {subjective} takes risks others might not.",
        "“Rich folk don’t know the satisfaction of hard work.”",
        "“Our luck depends on respecting its rules — now throw this salt over your shoulder.”",
        "“Take all that you can and leave nothing for the scavengers.”",
        "{Subjective} never leaves a friend behind.",
        "“No creature should be made to suffer.”",
        "Change is good, which is why {subjective} lives by an ever-changing set of rules.",
        "{Subjective} won’t let go of a grudge.",
        "{Subjective} will do whatever it takes to get what {subjective} wants, regardless of the harm it might cause.",
        "{Subjective} thinks the whole multiverse is out to get {objective}.",
        "“To prosper, you have to be in control.”",
        "Where there’s life, there’s hope. If {subjective} remain alive and flexible, {subjective} can succeed.",
        "{Possessive} family means everything to {objective}. {Subjective} failed them before, and {subjective} must not do so again.",
        "{Subjective} failed, but {subjective} is awesome. So when anyone else is successful, it must be because of nepotism, dishonesty, or dumb luck.",
        "{Subjective} finds that most people are trustworthy.",
        "{Subjective} likes pulling the strings.",
        "{Subjective} values the freedom to pursue {possessive} own goals without interference.",
        "{Subjective} doesn't believe in anything, and anyone who does is a fool.",
        "{Subjective} will never get out of {possessive} famous parent’s shadow, and no one else will ever understand this burden.",
        "The only way to get ahead in this world is to attain power and hold onto it with all your might.",
        "“Those who can find or make peace in the chaotic world around them have everything.”",
        "{Subjective} wants to be successful. And alone. With lots of guards and wards between {objective} and everyone else in the world.",
        "{Possessive} best days are behind {objective}. Ahead lies only toil, pain, and death.",
        "“You have to look out for yourself. No one else will.”",
        "“It isn’t right for innocents to suffer because of the arrogance of the powerful.”",
        "“Anything worth doing is worth doing with your whole heart.”",
        "{Subjective} just want things the way {subjective} like them: neat, orderly, and clean.",
        "“Obstacles exist to be overcome.”",
        "“Anything worth doing is worth doing right.”",
        "“Every game has rules, and the playing field must be level.”",
        "{Subjective} won’t risk {possessive} life for nothing. {Subjective} expects some kind of payment.",
        "“Nothing is more exhilarating than a narrow escape from the jaws of death.”",
        "“One must not interfere with the affairs of another culture—even one in need of aid.”",
        "“By understanding other races and cultures, we learn to understand ourselves.”",
        "“Common people crave strong leadership, and {subjective} does {possessive} utmost to provide it.”",
        "“Life is cruel. What’s the point in saving people if they’re going to die anyway?”",
        "{Subjective} believes that {subjective} is intellectually superior to people from other cultures and have much to teach them.",
        "{Subjective} is a free spirit--no one tells {objective} what to do.",
        "{Subjective} believes material goods come and go. Bonds of friendship last forever.",
        "{Subjective} is loyal to {possessive} friends, not to any ideals, and everyone else can take a trip down the Styx for all {subjective} cares.",
        "{Subjective} believes there's a spark of good in everyone.",
        "{Subjective} believes the world is in need of new ideas and bold action.",
        "{Subjective} believes people deserve to be treated with dignity and respect.",
        "{Subjective} believes no one should get preferential treatment before the law, and no one is above the law.",
        "If {subjective} becomes strong, {subjective} can take what {subjective} wants--what {subjective} deserves.",
        "There's no good pretending to be something {subjective} is not.",
        "Nothing and no one can steer {objective} away from {possessive} higher calling.",
        "{Subjective} believes it is the duty of all civilized people to strengthen the bonds of community and the security of civilization.",
        "{Possessive} talents were given to {objective} so that {subjective} could use them to benefit the world.",
        "{Subjective} believes everyone should be free to pursue his or her livelihood.",
        "{Subjective} is committed to the people {subjective} cares about, not to ideals.",
        "{Possessive} gifts are meant to be shared with all, not used for {possessive} own benefit.",
        "{Subjective} does not let emotions {possessive} sense of what is right and true, or {possessive} logical thinking.",
        "{Subjective} doesn't meddle in the affairs of others, because it only causes trouble.",
        "{Subjective} knows {objective}self, so there's nothing left to know.",
        "Respect is due to {objective} because of {possessive} position, but all people regardless of station deserve to be treated with dignity.",
        "It is {possessive} duty to respect the authority of those above {objective}, just as those below {objective} must respect {possessive}.",
        "{Subjective} must prove that {subjective} can handle {objective}self without the coddling of {possessive} family.",
        "If {subjective} can attain more power, no one will tell {objective} what to do.",
        "{Subjective} strongly believes blood runs thicker than water, but does not realize this originally means the blood of the covenant is thicker than the water of the womb.",
        "It is {possessive} duty to protect and care for the people beneath {objective}.",
        "{Subjective} thinks {possessive} life is like the seasons, in constant change, and {subjective} must change with it.",
        "What is beautiful points {objective} beyond itself toward what is true.",
        "{Subjective} does not let emotions cloud {possessive} logical thinking.",
        "{Subjective} believes nothing should fetter the infinite possibility inherent in all existence.",
        "{Subjective} believes that if we all do the work, we should all share in the rewards.",
        "{Subjective} does what {subjective} must and obey just authority.",
        "{Possessive} people are all that matter.",
        "“All people, rich or poor, deserve respect.”",
        "{Subjective} thinks we have to take care of each other, because no one else is going to do it.",
        "{Subjective} believes the low are lifted up, and the high and mighty are brought down. Change is the nature of things.",
        "{Subjective} helps people who help {objective}--that's what keeps us alive.",
        "Someone {subjective} loved died because of a mistake {subjective} made. That will never happen again.",
        "{Subjective} idolizes a hero of the old tales and measures {possessive} deeds against that person's.",
        "Nothing is more important than the other members of {possessive} hermitage, order, or association.",
        "Nothing is more important than the other members of {possessive} family.",
        "{Subjective} is in love with the heir of a family that {possessive} family despises.",
        "{Possessive} loyalty to {possessive} sovereign is unwavering.",
        "{Possessive} family, clan, or tribe is the most important thing in {possessive} life, even when they are far from {objective}.",
        "{Subjective} doesn't want any one else to have to endure the hardships {subjective} has been through.",
        "{Subjective} judges others harshly, and {objective}self even more severely.",
        "{Subjective} is inflexible in {possessive} thinking.",
        "{Subjective} is suspicious of strangers and suspect the worst of them.",
        "Once {subjective} picks a goal, {subjective} become obsessed with it to the detriment of everything else in {possessive} life.",
        "{Subjective} can't resist a pretty face.",
        "{Subjective} is too greedy for {possessive} own good. {Subjective} can't resist taking a risk if there's money involved.",
        "{Subjective} hates to admit it and will hate {objective}self for it, but {subjective}'ll run and preserve {possessive} own hide if the going gets tough.",
        "When faced with a choice between money and {possessive} friends, {subjective} usually chooses the money.",
        "If there's a plan, {subjective} will forget it. If {subjective} doesn't forget it, {subjective} will ignore it.",
        "{Subjective} has a 'tell' that reveals when {subjective} is lying.",
        "{Subjective} turns tail and runs when things go bad.",
        "An innocent person is in prison for a crime that {subjective} committed. {Subjective} is okay with that.",
        "{Subjective} is a sucker for a pretty face.",
        "A scandal prevents {objective} from ever going home again. That kind of trouble seems to follow {objective} around.",
        "{Subjective} have trouble keeping {possessive} true feelings hidden. {Possessive} sharp tongue lands {objective} in trouble.",
        "Despite {possessive} best efforts, {subjective} is unreliable to {possessive} friends.",
        "The tyrant who rules {possessive} land will stop at nothing to see {objective} killed.",
        "{Subjective} is convinced of the significance of {possessive} destiny, and blind to {possessive} shortcomings and the risk of failure.",
        "{Subjective} believes chains are meant to be broken, as are those who would forge them.",
        "The people who knew {objective} when {subjective} was young know {possessive} shameful secret, so {subjective} can never go home again.",
        "{Subjective} has a weakness for the vices of the city, especially hard drink.",
        "Secretly, {subjective} believes that things would be better if {subjective} were a tyrant lording over the land.",
        "{Subjective} has trouble trusting in {possessive} allies.",
        "{Subjective} is quick to assume that someone is trying to cheat {objective}.",
        "No one must ever learn that {subjective} once stole money from guild coffers.",
        "{Subjective} is never satisfied with what {subjective} has--{subjective} always wants more.",
        "{Subjective} is horribly jealous of anyone who outshines {possessive} handiwork. Everywhere {subjective} goes, {subjective} is surrounded by rivals.",
        "{Subjective} is dogmatic in {possessive} thoughts and philosophy.",
        "{Subjective} lets {possessive} need to win arguments overshadow friendships and harmony.",
        "{Subjective} would risk too much to uncover a lost bit of knowledge.",
        "{Subjective} likes keeping secrets and won't share them with anyone.",
        "{Subjective} secretly believes that everyone is beneath {objective}.",
        "{Subjective} hides a truly scandalous secret that could ruin {possessive} family forever.",
        "{Subjective} too often hears veiled insults and threats in every word addressed to {objective}, and {subjective} is quick to anger.",
        "{Subjective} has an insatiable desire for carnal pleasures.",
        "In fact, the world does revolve around {objective}.",
        "By {possessive} words and actions, {subjective} often brings shame to {possessive} family.",
        "{Subjective} is too enamored of ale, wine, and other intoxicants.",
        "{Subjective} believes there's no room for caution in a life lived to the fullest.",
        "{Subjective} remembers every insult {subjective} has received and nurses a silent resentment toward anyone who's ever wronged {objective}.",
        "{Subjective} is slow to trust members of other races",
        "Violence is {possessive} answer to almost any challenge.",
        "Don't expect {objective} to save those who can't save themselves. It is nature's way that the strong thrive and the weak perish.",
        "{Subjective} overlooks obvious solutions in favor of complicated ones.",
        "{Subjective} speaks without really thinking through {possessive} words, invariably insulting others.",
        "{Subjective} can't keep a secret to save {possessive} life, or anyone else's.",
        "{Subjective} follows orders, even if {subjective} thinks they're wrong.",
        "{Subjective}'ll say anything to avoid having to do extra work.",
        "Once someone questions {possessive} courage, {subjective} never backs down no matter how dangerous the situation.",
        "Once {subjective} starts drinking, it's hard for {objective} to stop.",
        "{Subjective} can't help but pocket loose coins and other trinkets {subjective} come across.",
        "{Possessive} pride will probably lead to {possessive} destruction",
        "{Possessive} hatred of {possessive} enemies is blind and unreasoning.",
        "{Subjective} obeys the law, even if the law causes misery.",
        "{Subjective}'d rather eat {possessive} armor than admit when {subjective} is wrong.",
        "If {subjective} is outnumbered, {subjective} always runs away from a fight.",
        "Gold seems like a lot of money to {objective}, and {subjective} will do just about anything for more of it.",
        "{Subjective} will never fully trust anyone other than {objective}self.",
        "{Subjective} would rather kill someone in their sleep than fight fair.",
        "{Subjective} believes people who don't take care of themselves get what they deserve.",
        "{Subjective} will face any challenge to win the approval of {possessive} family."
    ],
	"law": [
        "{Subjective} considers coercion a fine way of ensuring that the laws are obeyed.",
        "“The law is meant to ensure that the gears of society turn smoothly and quietly.”",
        "“The ultimate object of the law is to remove violence from society.”",
        "“The law embodies excellence in its precision and detail.”",
        "“A public display of consequences is an excellent deterrent for criminals.”",
        "“Those who break the law need to answer for their crimes.”",
        "“A nation built upon just foundations will uphold freedom for all.”",
        "“Achieving justice requires establishing fair, equitable, and compassionate relationships within a community.”"
    ]
}